ahtn/keyplus/ports/efm8/efm8/mcu/C8051F326/inc/SI_C8051F326_Register_Enums.h
//------------------------------------------------------------------------------
// Copyright 2014 Silicon Laboratories, Inc.
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//Supported Devices:
//  C8051F326_GM
//  C8051F327_GM

#ifndef SI_C8051F326_REGISTER_ENUMS_H
#define SI_C8051F326_REGISTER_ENUMS_H

//Standard device includes
#include "SI_C8051F326_Defs.h"
//------------------------------------------------------------------------------
// ACC Enums (Accumulator @ 0xE0)
//------------------------------------------------------------------------------
#define ACC_ACC__FMASK 0xFF ///< Accumulator
#define ACC_ACC__SHIFT 0x00 ///< Accumulator
                                            
//------------------------------------------------------------------------------
// B Enums (B Register @ 0xF0)
//------------------------------------------------------------------------------
#define B_B__FMASK 0xFF ///< B Register
#define B_B__SHIFT 0x00 ///< B Register
                                       
//------------------------------------------------------------------------------
// DPH Enums (Data Pointer High @ 0x83)
//------------------------------------------------------------------------------
#define DPH_DPH__FMASK 0xFF ///< Data Pointer High
#define DPH_DPH__SHIFT 0x00 ///< Data Pointer High
                                                  
//------------------------------------------------------------------------------
// DPL Enums (Data Pointer Low @ 0x82)
//------------------------------------------------------------------------------
#define DPL_DPL__FMASK 0xFF ///< Data Pointer Low
#define DPL_DPL__SHIFT 0x00 ///< Data Pointer Low
                                                 
//------------------------------------------------------------------------------
// PSW Enums (Program Status Word @ 0xD0)
//------------------------------------------------------------------------------
#define PSW_PARITY__BMASK   0x01 ///< Parity Flag                                       
#define PSW_PARITY__SHIFT   0x00 ///< Parity Flag                                       
#define PSW_PARITY__NOT_SET 0x00 ///< The sum of the 8 bits in the accumulator is even. 
#define PSW_PARITY__SET     0x01 ///< The sum of the 8 bits in the accumulator is odd.  
                                                                                        
#define PSW_F1__BMASK       0x02 ///< User Flag 1                                       
#define PSW_F1__SHIFT       0x01 ///< User Flag 1                                       
#define PSW_F1__NOT_SET     0x00 ///< Flag is not set.                                  
#define PSW_F1__SET         0x02 ///< Flag is set.                                      
                                                                                        
#define PSW_OV__BMASK       0x04 ///< Overflow Flag                                     
#define PSW_OV__SHIFT       0x02 ///< Overflow Flag                                     
#define PSW_OV__NOT_SET     0x00 ///< An overflow did not occur.                        
#define PSW_OV__SET         0x04 ///< An overflow occurred.                             
                                                                                        
#define PSW_RS__FMASK       0x18 ///< Register Bank Select                              
#define PSW_RS__SHIFT       0x03 ///< Register Bank Select                              
#define PSW_RS__BANK0       0x00 ///< Bank 0, Addresses 0x00-0x07                       
#define PSW_RS__BANK1       0x08 ///< Bank 1, Addresses 0x08-0x0F                       
#define PSW_RS__BANK2       0x10 ///< Bank 2, Addresses 0x10-0x17                       
#define PSW_RS__BANK3       0x18 ///< Bank 3, Addresses 0x18-0x1F                       
                                                                                        
#define PSW_F0__BMASK       0x20 ///< User Flag 0                                       
#define PSW_F0__SHIFT       0x05 ///< User Flag 0                                       
#define PSW_F0__NOT_SET     0x00 ///< Flag is not set.                                  
#define PSW_F0__SET         0x20 ///< Flag is set.                                      
                                                                                        
#define PSW_AC__BMASK       0x40 ///< Auxiliary Carry Flag                              
#define PSW_AC__SHIFT       0x06 ///< Auxiliary Carry Flag                              
#define PSW_AC__NOT_SET     0x00 ///< A carry into (addition) or borrow from            
                                 ///< (subtraction) the high order nibble did not occur.
#define PSW_AC__SET         0x40 ///< A carry into (addition) or borrow from            
                                 ///< (subtraction) the high order nibble occurred.     
                                                                                        
#define PSW_CY__BMASK       0x80 ///< Carry Flag                                        
#define PSW_CY__SHIFT       0x07 ///< Carry Flag                                        
#define PSW_CY__NOT_SET     0x00 ///< A carry (addition) or borrow (subtraction) did not
                                 ///< occur.                                            
#define PSW_CY__SET         0x80 ///< A carry (addition) or borrow (subtraction)        
                                 ///< occurred.                                         
                                                                                        
//------------------------------------------------------------------------------
// SP Enums (Stack Pointer @ 0x81)
//------------------------------------------------------------------------------
#define SP_SP__FMASK 0xFF ///< Stack Pointer
#define SP_SP__SHIFT 0x00 ///< Stack Pointer
                                            
//------------------------------------------------------------------------------
// CLKMUL Enums (Clock Multiplier Control @ 0xB9)
//------------------------------------------------------------------------------
#define CLKMUL_MULSEL__BMASK    0x01 ///< Clock Multiplier Input Select             
#define CLKMUL_MULSEL__SHIFT    0x00 ///< Clock Multiplier Input Select             
#define CLKMUL_MULSEL__HFOSC    0x00 ///< Clock Multiplier input clock source is the
                                     ///< Internal High-Frequency Oscillator.       
#define CLKMUL_MULSEL__EXTOSC   0x01 ///< Clock Multiplier input clock source is the
                                     ///< External Oscillator.                      
                                                                                    
#define CLKMUL_MULRDY__BMASK    0x20 ///< Clock Multiplier Ready                    
#define CLKMUL_MULRDY__SHIFT    0x05 ///< Clock Multiplier Ready                    
#define CLKMUL_MULRDY__NOT_SET  0x00 ///< Clock Multiplier not ready.               
#define CLKMUL_MULRDY__SET      0x20 ///< Clock Multiplier is ready (locked).       
                                                                                    
#define CLKMUL_MULINIT__BMASK   0x40 ///< Clock Multiplier Initialize               
#define CLKMUL_MULINIT__SHIFT   0x06 ///< Clock Multiplier Initialize               
#define CLKMUL_MULINIT__NOT_SET 0x00 ///< Do not initialize the Clock Multiplier.   
#define CLKMUL_MULINIT__SET     0x40 ///< Initialize the Clock Multiplier.          
                                                                                    
#define CLKMUL_MULEN__BMASK     0x80 ///< Clock Multiplier Enable                   
#define CLKMUL_MULEN__SHIFT     0x07 ///< Clock Multiplier Enable                   
#define CLKMUL_MULEN__DISABLED  0x00 ///< Disable the Clock Multiplier.             
#define CLKMUL_MULEN__ENABLED   0x80 ///< Enable the Clock Multiplier.              
                                                                                    
//------------------------------------------------------------------------------
// CLKSEL Enums (Clock Select @ 0xA9)
//------------------------------------------------------------------------------
#define CLKSEL_CLKSL__FMASK         0x07 ///< System Clock Source Select Bits                   
#define CLKSEL_CLKSL__SHIFT         0x00 ///< System Clock Source Select Bits                   
#define CLKSEL_CLKSL__DIVIDED_HFOSC 0x00 ///< Clock (SYSCLK) derived from the Internal High-    
                                         ///< Frequency Oscillator and scaled per the IFCN bits 
                                         ///< in register OSCICN.                               
#define CLKSEL_CLKSL__EXTOSC        0x01 ///< Clock (SYSCLK) derived from the External          
                                         ///< Oscillator circuit.                               
#define CLKSEL_CLKSL__CLKMUL_DIV_2  0x02 ///< Clock (SYSCLK) derived from the 4x Clock          
                                         ///< Multiplier / 2.                                   
#define CLKSEL_CLKSL__LFOSC         0x03 ///< Clock (SYSCLK) derived from the Internal Low-     
                                         ///< Frequency Oscillator.                             
                                                                                                
#define CLKSEL_USBCLK__FMASK        0x30 ///< USB Clock Source Select Bits                      
#define CLKSEL_USBCLK__SHIFT        0x04 ///< USB Clock Source Select Bits                      
#define CLKSEL_USBCLK__CLKMUL       0x00 ///< USB clock (USBCLK) derived from the 4x Clock      
                                         ///< Multiplier.                                       
#define CLKSEL_USBCLK__HFOSC_DIV_2  0x10 ///< USB clock (USBCLK) derived from the Internal High-
                                         ///< Frequency Oscillator / 2.                         
#define CLKSEL_USBCLK__EXTOSC       0x20 ///< USB clock (USBCLK) derived from the External      
                                         ///< Oscillator.                                       
#define CLKSEL_USBCLK__OFF          0x30 ///< USB clock (USBCLK) off.                           
                                                                                                
//------------------------------------------------------------------------------
// FLKEY Enums (Flash Lock and Key @ 0xB7)
//------------------------------------------------------------------------------
#define FLKEY_FLKEY__FMASK    0xFF ///< Flash Lock and Key Register                       
#define FLKEY_FLKEY__SHIFT    0x00 ///< Flash Lock and Key Register                       
#define FLKEY_FLKEY__LOCKED   0x00 ///< Flash is write/erase locked.                      
#define FLKEY_FLKEY__FIRST    0x01 ///< The first key code has been written (0xA5).       
#define FLKEY_FLKEY__UNLOCKED 0x02 ///< Flash is unlocked (writes/erases allowed).        
#define FLKEY_FLKEY__DISABLED 0x03 ///< Flash writes/erases disabled until the next reset.
#define FLKEY_FLKEY__KEY1     0xA5 ///< Flash writes and erases are enabled by writing    
                                   ///< 0xA5 followed by 0xF1 to the FLKEY register.      
#define FLKEY_FLKEY__KEY2     0xF1 ///< Flash writes and erases are enabled by writing    
                                   ///< 0xA5 followed by 0xF1 to the FLKEY register.      
                                                                                          
//------------------------------------------------------------------------------
// FLSCL Enums (Flash Scale @ 0xB6)
//------------------------------------------------------------------------------
#define FLSCL_FOSE__BMASK    0x80 ///< Flash One-Shot Enable                   
#define FLSCL_FOSE__SHIFT    0x07 ///< Flash One-Shot Enable                   
#define FLSCL_FOSE__DISABLED 0x00 ///< Disable the flash one-shot.             
#define FLSCL_FOSE__ENABLED  0x80 ///< Enable the flash one-shot (recommended).
                                                                               
//------------------------------------------------------------------------------
// PSCTL Enums (Program Store Control @ 0x8F)
//------------------------------------------------------------------------------
#define PSCTL_PSWE__BMASK          0x01 ///< Program Store Write Enable                      
#define PSCTL_PSWE__SHIFT          0x00 ///< Program Store Write Enable                      
#define PSCTL_PSWE__WRITE_DISABLED 0x00 ///< Writes to flash program memory disabled.        
#define PSCTL_PSWE__WRITE_ENABLED  0x01 ///< Writes to flash program memory enabled; the MOVX
                                        ///< write instruction targets flash memory.         
                                                                                             
