ahtn/keyplus/ports/efm8/efm8/mcu/C8051F326/inc/SI_C8051F326_Register_Enums.h
#define PSCTL_PSEE__BMASK          0x02 ///< Program Store Erase Enable                      
#define PSCTL_PSEE__SHIFT          0x01 ///< Program Store Erase Enable                      
#define PSCTL_PSEE__ERASE_DISABLED 0x00 ///< Flash program memory erasure disabled.          
#define PSCTL_PSEE__ERASE_ENABLED  0x02 ///< Flash program memory erasure enabled.           
                                                                                             
//------------------------------------------------------------------------------
// OSCICL Enums (High Frequency Oscillator Calibration @ 0xB3)
//------------------------------------------------------------------------------
#define OSCICL_OSCICL__FMASK 0x1F ///< Internal Oscillator Calibration
#define OSCICL_OSCICL__SHIFT 0x00 ///< Internal Oscillator Calibration
                                                                      
//------------------------------------------------------------------------------
// OSCICN Enums (High Frequency Oscillator Control @ 0xB2)
//------------------------------------------------------------------------------
#define OSCICN_IFCN__FMASK       0x03 ///< Oscillator Frequency Divider Control             
#define OSCICN_IFCN__SHIFT       0x00 ///< Oscillator Frequency Divider Control             
#define OSCICN_IFCN__HFOSC_DIV_8 0x00 ///< SYSCLK derived from High Frequency Oscillator    
                                      ///< divided by 8.                                    
#define OSCICN_IFCN__HFOSC_DIV_4 0x01 ///< SYSCLK derived from High Frequency Oscillator    
                                      ///< divided by 4.                                    
#define OSCICN_IFCN__HFOSC_DIV_2 0x02 ///< SYSCLK derived from High Frequency Oscillator    
                                      ///< divided by 2.                                    
#define OSCICN_IFCN__HFOSC_DIV_1 0x03 ///< SYSCLK derived from High Frequency Oscillator    
                                      ///< divided by 1.                                    
                                                                                            
#define OSCICN_SUSPEND__BMASK    0x20 ///< Oscillator Suspend Enable                        
#define OSCICN_SUSPEND__SHIFT    0x05 ///< Oscillator Suspend Enable                        
#define OSCICN_SUSPEND__DISABLED 0x00 ///< The internal oscillator is not in suspend mode.  
#define OSCICN_SUSPEND__ENABLED  0x20 ///< Place the internal oscillator in suspend mode.   
                                                                                            
#define OSCICN_IFRDY__BMASK      0x40 ///< Oscillator Frequency Ready Flag                  
#define OSCICN_IFRDY__SHIFT      0x06 ///< Oscillator Frequency Ready Flag                  
#define OSCICN_IFRDY__NOT_SET    0x00 ///< The Internal High Frequency Oscillator is not    
                                      ///< running at the programmed frequency.             
#define OSCICN_IFRDY__SET        0x40 ///< The Internal High Frequency Oscillator is running
                                      ///< at the programmed frequency.                     
                                                                                            
#define OSCICN_IOSCEN__BMASK     0x80 ///< Oscillator Enable                                
#define OSCICN_IOSCEN__SHIFT     0x07 ///< Oscillator Enable                                
#define OSCICN_IOSCEN__DISABLED  0x00 ///< Disable the High Frequency Oscillator.           
#define OSCICN_IOSCEN__ENABLED   0x80 ///< Enable the High Frequency Oscillator.            
                                                                                            
//------------------------------------------------------------------------------
// EIE1 Enums (Extended Interrupt Enable 1 @ 0xE6)
//------------------------------------------------------------------------------
#define EIE1_EUSB0__BMASK    0x02 ///< USB (USB0) Interrupt Enable                 
#define EIE1_EUSB0__SHIFT    0x01 ///< USB (USB0) Interrupt Enable                 
#define EIE1_EUSB0__DISABLED 0x00 ///< Disable all USB0 interrupts.                
#define EIE1_EUSB0__ENABLED  0x02 ///< Enable interrupt requests generated by USB0.
                                                                                   
//------------------------------------------------------------------------------
// EIE2 Enums (Extended Interrupt Enable 2 @ 0xE7)
//------------------------------------------------------------------------------
#define EIE2_EVBUS__BMASK    0x01 ///< VBUS Level Interrupt Enable                      
#define EIE2_EVBUS__SHIFT    0x00 ///< VBUS Level Interrupt Enable                      
#define EIE2_EVBUS__DISABLED 0x00 ///< Disable all VBUS interrupts.                     
#define EIE2_EVBUS__ENABLED  0x01 ///< Enable interrupt requests generated by VBUS level
                                  ///< sense.                                           
                                                                                        
//------------------------------------------------------------------------------
// EIP1 Enums (Extended Interrupt Priority 1 @ 0xF6)
//------------------------------------------------------------------------------
#define EIP1_PUSB0__BMASK 0x02 ///< USB (USB0) Interrupt Priority Control     
#define EIP1_PUSB0__SHIFT 0x01 ///< USB (USB0) Interrupt Priority Control     
#define EIP1_PUSB0__LOW   0x00 ///< USB0 interrupt set to low priority level. 
#define EIP1_PUSB0__HIGH  0x02 ///< USB0 interrupt set to high priority level.
                                                                              
//------------------------------------------------------------------------------
// EIP2 Enums (Extended Interrupt Priority 2 @ 0xF7)
//------------------------------------------------------------------------------
#define EIP2_PVBUS__BMASK 0x01 ///< VBUS Level Interrupt Priority Control     
#define EIP2_PVBUS__SHIFT 0x00 ///< VBUS Level Interrupt Priority Control     
#define EIP2_PVBUS__LOW   0x00 ///< VBUS interrupt set to low priority level. 
#define EIP2_PVBUS__HIGH  0x01 ///< VBUS interrupt set to high priority level.
                                                                              
//------------------------------------------------------------------------------
// IE Enums (Interrupt Enable @ 0xA8)
//------------------------------------------------------------------------------
#define IE_EX0__BMASK    0x01 ///< External Interrupt 0 Enable                      
#define IE_EX0__SHIFT    0x00 ///< External Interrupt 0 Enable                      
#define IE_EX0__DISABLED 0x00 ///< Disable external interrupt 0.                    
#define IE_EX0__ENABLED  0x01 ///< Enable interrupt requests generated by the /INT0 
                              ///< input.                                           
                                                                                    
#define IE_ET0__BMASK    0x02 ///< Timer 0 Interrupt Enable                         
#define IE_ET0__SHIFT    0x01 ///< Timer 0 Interrupt Enable                         
#define IE_ET0__DISABLED 0x00 ///< Disable all Timer 0 interrupt.                   
#define IE_ET0__ENABLED  0x02 ///< Enable interrupt requests generated by the TF0   
                              ///< flag.                                            
                                                                                    
