ahtn/keyplus/ports/efm8/efm8/mcu/C8051F326/inc/SI_C8051F326_Register_Enums.h
#define IE_EX1__BMASK    0x04 ///< External Interrupt 1 Enable                      
#define IE_EX1__SHIFT    0x02 ///< External Interrupt 1 Enable                      
#define IE_EX1__DISABLED 0x00 ///< Disable external interrupt 1.                    
#define IE_EX1__ENABLED  0x04 ///< Enable interrupt requests generated by the /INT1 
                              ///< input.                                           
                                                                                    
#define IE_ET1__BMASK    0x08 ///< Timer 1 Interrupt Enable                         
#define IE_ET1__SHIFT    0x03 ///< Timer 1 Interrupt Enable                         
#define IE_ET1__DISABLED 0x00 ///< Disable all Timer 1 interrupt.                   
#define IE_ET1__ENABLED  0x08 ///< Enable interrupt requests generated by the TF1   
                              ///< flag.                                            
                                                                                    
#define IE_ES0__BMASK    0x10 ///< UART0 Interrupt Enable                           
#define IE_ES0__SHIFT    0x04 ///< UART0 Interrupt Enable                           
#define IE_ES0__DISABLED 0x00 ///< Disable UART0 interrupt.                         
#define IE_ES0__ENABLED  0x10 ///< Enable UART0 interrupt.                          
                                                                                    
#define IE_EA__BMASK     0x80 ///< All Interrupts Enable                            
#define IE_EA__SHIFT     0x07 ///< All Interrupts Enable                            
#define IE_EA__DISABLED  0x00 ///< Disable all interrupt sources.                   
#define IE_EA__ENABLED   0x80 ///< Enable each interrupt according to its individual
                              ///< mask setting.                                    
                                                                                    
//------------------------------------------------------------------------------
// IP Enums (Interrupt Priority @ 0xB8)
//------------------------------------------------------------------------------
#define IP_PX0__BMASK 0x01 ///< External Interrupt 0 Priority Control           
#define IP_PX0__SHIFT 0x00 ///< External Interrupt 0 Priority Control           
#define IP_PX0__LOW   0x00 ///< External Interrupt 0 set to low priority level. 
#define IP_PX0__HIGH  0x01 ///< External Interrupt 0 set to high priority level.
                                                                                
#define IP_PT0__BMASK 0x02 ///< Timer 0 Interrupt Priority Control              
#define IP_PT0__SHIFT 0x01 ///< Timer 0 Interrupt Priority Control              
#define IP_PT0__LOW   0x00 ///< Timer 0 interrupt set to low priority level.    
#define IP_PT0__HIGH  0x02 ///< Timer 0 interrupt set to high priority level.   
                                                                                
#define IP_PX1__BMASK 0x04 ///< External Interrupt 1 Priority Control           
#define IP_PX1__SHIFT 0x02 ///< External Interrupt 1 Priority Control           
#define IP_PX1__LOW   0x00 ///< External Interrupt 1 set to low priority level. 
#define IP_PX1__HIGH  0x04 ///< External Interrupt 1 set to high priority level.
                                                                                
#define IP_PT1__BMASK 0x08 ///< Timer 1 Interrupt Priority Control              
#define IP_PT1__SHIFT 0x03 ///< Timer 1 Interrupt Priority Control              
#define IP_PT1__LOW   0x00 ///< Timer 1 interrupt set to low priority level.    
#define IP_PT1__HIGH  0x08 ///< Timer 1 interrupt set to high priority level.   
                                                                                
#define IP_PS0__BMASK 0x10 ///< UART0 Interrupt Priority Control                
#define IP_PS0__SHIFT 0x04 ///< UART0 Interrupt Priority Control                
#define IP_PS0__LOW   0x00 ///< UART0 interrupt set to low priority level.      
#define IP_PS0__HIGH  0x10 ///< UART0 interrupt set to high priority level.     
                                                                                
//------------------------------------------------------------------------------
// OSCLCN Enums (Internal Low Frequency Oscillator Control @ 0xE3)
//------------------------------------------------------------------------------
#define OSCLCN_OSCLEN__BMASK    0x80 ///< Oscillator Enable                    
#define OSCLCN_OSCLEN__SHIFT    0x07 ///< Oscillator Enable                    
#define OSCLCN_OSCLEN__DISABLED 0x00 ///< Disable the Low Frequency Oscillator.
#define OSCLCN_OSCLEN__ENABLED  0x80 ///< Enable the Low Frequency Oscillator. 
                                                                               
//------------------------------------------------------------------------------
// GPIOCN Enums (Global Port I/O Control @ 0xE2)
//------------------------------------------------------------------------------
#define GPIOCN_SYSCKE__BMASK              0x01 ///< SYSCLK Output Enable                              
#define GPIOCN_SYSCKE__SHIFT              0x00 ///< SYSCLK Output Enable                              
#define GPIOCN_SYSCKE__DISABLED           0x00 ///< SYSCLK unavailable at P0.0 pin. P0.0 latch routed 
                                               ///< to P0.0 pin.                                      
#define GPIOCN_SYSCKE__ENABLED            0x01 ///< SYSCLK routed to P0.0. P0.0 latch unavailable at  
                                               ///< P0.0 pin.                                         
                                                                                                      
#define GPIOCN_INPUTEN__BMASK             0x40 ///< Global Digital Input Enable                       
#define GPIOCN_INPUTEN__SHIFT             0x06 ///< Global Digital Input Enable                       
#define GPIOCN_INPUTEN__DISABLED          0x00 ///< Port I/O input path disabled, and port pins can be
                                               ///< used as outputs only.                             
#define GPIOCN_INPUTEN__ENABLED           0x40 ///< Port I/O input path enabled.                      
                                                                                                      
#define GPIOCN_WEAKPUD__BMASK             0x80 ///< Port I/O Weak Pullup Disable                      
#define GPIOCN_WEAKPUD__SHIFT             0x07 ///< Port I/O Weak Pullup Disable                      
#define GPIOCN_WEAKPUD__PULL_UPS_ENABLED  0x00 ///< Weak Pullups enabled (except for I/O pins with    
                                               ///< Port latches set to logic 0 or are configured to  
                                               ///< push-pull mode).                                  
#define GPIOCN_WEAKPUD__PULL_UPS_DISABLED 0x80 ///< Weak Pullups disabled.                            
                                                                                                      
//------------------------------------------------------------------------------
// PCON Enums (Power Control @ 0x87)
//------------------------------------------------------------------------------
#define PCON_IDLE__BMASK  0x01 ///< Idle Mode Select                                
#define PCON_IDLE__SHIFT  0x00 ///< Idle Mode Select                                
#define PCON_IDLE__NORMAL 0x00 ///< Idle mode not activated.                        
#define PCON_IDLE__IDLE   0x01 ///< CPU goes into Idle mode (shuts off clock to CPU,
                               ///< but clocks to enabled peripherals are still     
                               ///< active).                                        
                                                                                    
