ahtn/keyplus/ports/efm8/efm8/mcu/C8051F326/inc/SI_C8051F326_Register_Enums.h
#define TCON_TF0__BMASK   0x20 ///< Timer 0 Overflow Flag    
#define TCON_TF0__SHIFT   0x05 ///< Timer 0 Overflow Flag    
#define TCON_TF0__NOT_SET 0x00 ///< Timer 0 did not overflow.
#define TCON_TF0__SET     0x20 ///< Timer 0 overflowed.      
                                                             
#define TCON_TR1__BMASK   0x40 ///< Timer 1 Run Control      
#define TCON_TR1__SHIFT   0x06 ///< Timer 1 Run Control      
#define TCON_TR1__STOP    0x00 ///< Stop Timer 1.            
#define TCON_TR1__RUN     0x40 ///< Start Timer 1 running.   
                                                             
#define TCON_TF1__BMASK   0x80 ///< Timer 1 Overflow Flag    
#define TCON_TF1__SHIFT   0x07 ///< Timer 1 Overflow Flag    
#define TCON_TF1__NOT_SET 0x00 ///< Timer 1 did not overflow.
#define TCON_TF1__SET     0x80 ///< Timer 1 overflowed.      
                                                             
//------------------------------------------------------------------------------
// TMOD Enums (Timer 0/1 Mode @ 0x89)
//------------------------------------------------------------------------------
#define TMOD_T0M__FMASK      0x03 ///< Timer 0 Mode Select                               
#define TMOD_T0M__SHIFT      0x00 ///< Timer 0 Mode Select                               
#define TMOD_T0M__MODE0      0x00 ///< Mode 0, 13-bit Counter/Timer                      
#define TMOD_T0M__MODE1      0x01 ///< Mode 1, 16-bit Counter/Timer                      
#define TMOD_T0M__MODE2      0x02 ///< Mode 2, 8-bit Counter/Timer with Auto-Reload      
#define TMOD_T0M__MODE3      0x03 ///< Mode 3, Two 8-bit Counter/Timers                  
                                                                                         
#define TMOD_GATE0__BMASK    0x08 ///< Timer 0 Gate Control                              
#define TMOD_GATE0__SHIFT    0x03 ///< Timer 0 Gate Control                              
#define TMOD_GATE0__DISABLED 0x00 ///< Timer 0 enabled when TR0 = 1 irrespective of /INT0
                                  ///< logic level.                                      
#define TMOD_GATE0__ENABLED  0x08 ///< Timer 0 enabled only when TR0 = 1 and /INT0 is    
                                  ///< active as defined by bit IN0PL in register IT01CF.
                                                                                         
#define TMOD_T1M__FMASK      0x30 ///< Timer 1 Mode Select                               
#define TMOD_T1M__SHIFT      0x04 ///< Timer 1 Mode Select                               
#define TMOD_T1M__MODE0      0x00 ///< Mode 0, 13-bit Counter/Timer                      
#define TMOD_T1M__MODE1      0x10 ///< Mode 1, 16-bit Counter/Timer                      
#define TMOD_T1M__MODE2      0x20 ///< Mode 2, 8-bit Counter/Timer with Auto-Reload      
#define TMOD_T1M__MODE3      0x30 ///< Mode 3, Timer 1 Inactive                          
                                                                                         
#define TMOD_GATE1__BMASK    0x80 ///< Timer 1 Gate Control                              
#define TMOD_GATE1__SHIFT    0x07 ///< Timer 1 Gate Control                              
#define TMOD_GATE1__DISABLED 0x00 ///< Timer 1 enabled when TR1 = 1 irrespective of /INT1
                                  ///< logic level.                                      
#define TMOD_GATE1__ENABLED  0x80 ///< Timer 1 enabled only when TR1 = 1 and /INT1 is    
                                  ///< active as defined by bit IN1PL in register IT01CF.
                                                                                         
//------------------------------------------------------------------------------
// SBCON0 Enums (UART0 Baud Rate Generator Control @ 0x91)
//------------------------------------------------------------------------------
#define SBCON0_SBPS__FMASK     0x03 ///< Baud Rate Prescaler Select                        
#define SBCON0_SBPS__SHIFT     0x00 ///< Baud Rate Prescaler Select                        
#define SBCON0_SBPS__DIV_BY_12 0x00 ///< Prescaler = 12.                                   
#define SBCON0_SBPS__DIV_BY_4  0x01 ///< Prescaler = 4.                                    
#define SBCON0_SBPS__DIV_BY_48 0x02 ///< Prescaler = 48.                                   
#define SBCON0_SBPS__DIV_BY_1  0x03 ///< Prescaler = 1.                                    
                                                                                           
#define SBCON0_SBRUN__BMASK    0x40 ///< Baud Rate Generator Enable                        
#define SBCON0_SBRUN__SHIFT    0x06 ///< Baud Rate Generator Enable                        
#define SBCON0_SBRUN__DISABLED 0x00 ///< Disable the baud rate generator. UART0 will not   
                                    ///< function.                                         
#define SBCON0_SBRUN__ENABLED  0x40 ///< Enable the baud rate generator.                   
                                                                                           
#define SBCON0_SBCLK__BMASK    0x80 ///< Baud Rate Generator Clock Source                  
#define SBCON0_SBCLK__SHIFT    0x07 ///< Baud Rate Generator Clock Source                  
#define SBCON0_SBCLK__SYSCLK   0x00 ///< The system clock (SYSCLK) is used as the baud rate
                                    ///< generator clock source.                           
#define SBCON0_SBCLK__USBCLK   0x80 ///< The USB clock (USBCLK) is used as the baud rate   
                                    ///< generator clock source.                           
                                                                                           
//------------------------------------------------------------------------------
// SBRLH0 Enums (UART0 Baud Rate Generator High Byte @ 0x94)
//------------------------------------------------------------------------------
#define SBRLH0_SBRL__FMASK 0xFF ///< UART0 Baud Rate Reload High
#define SBRLH0_SBRL__SHIFT 0x00 ///< UART0 Baud Rate Reload High
                                                                
//------------------------------------------------------------------------------
// SBRLL0 Enums (UART0 Baud Rate Generator Low Byte @ 0x93)
//------------------------------------------------------------------------------
#define SBRLL0_SBRL__FMASK 0xFF ///< UART0 Baud Rate Reload Low
#define SBRLL0_SBRL__SHIFT 0x00 ///< UART0 Baud Rate Reload Low
                                                               
//------------------------------------------------------------------------------
// SBUF0 Enums (UART0 Serial Port Data Buffer @ 0x99)
//------------------------------------------------------------------------------
#define SBUF0_SBUF0__FMASK 0xFF ///< Serial Port Data Buffer
#define SBUF0_SBUF0__SHIFT 0x00 ///< Serial Port Data Buffer
                                                            
//------------------------------------------------------------------------------
// SCON0 Enums (UART0 Serial Port Control @ 0x98)
//------------------------------------------------------------------------------
#define SCON0_RI__BMASK             0x01 ///< Receive Interrupt Flag                           
#define SCON0_RI__SHIFT             0x00 ///< Receive Interrupt Flag                           
#define SCON0_RI__NOT_SET           0x00 ///< A byte of data has not been received by UART0.   
#define SCON0_RI__SET               0x01 ///< UART0 received a byte of data or data remains in 
                                         ///< the receive FIFO.                                
                                                                                               
