ahtn/keyplus/ports/efm8/efm8/mcu/C8051F326/inc/SI_C8051F326_Register_Enums.h
#define CMIE_SOFE__BMASK       0x08 ///< Start of Frame Interrupt Enable
#define CMIE_SOFE__SHIFT       0x03 ///< Start of Frame Interrupt Enable
#define CMIE_SOFE__DISABLED    0x00 ///< Disable SOF interrupts.        
#define CMIE_SOFE__ENABLED     0x08 ///< Enable SOF interrupts.         
                                                                        
//------------------------------------------------------------------------------
// CMINT Enums (USB0 Common Interrupt @ 0x06)
//------------------------------------------------------------------------------
#define CMINT_SUSINT__BMASK   0x01 ///< Suspend Interrupt Flag       
#define CMINT_SUSINT__SHIFT   0x00 ///< Suspend Interrupt Flag       
#define CMINT_SUSINT__NOT_SET 0x00 ///< Suspend interrupt inactive.  
#define CMINT_SUSINT__SET     0x01 ///< Suspend interrupt active.    
                                                                     
#define CMINT_RSUINT__BMASK   0x02 ///< Resume Interrupt Flag        
#define CMINT_RSUINT__SHIFT   0x01 ///< Resume Interrupt Flag        
#define CMINT_RSUINT__NOT_SET 0x00 ///< Resume interrupt inactive.   
#define CMINT_RSUINT__SET     0x02 ///< Resume interrupt active.     
                                                                     
#define CMINT_RSTINT__BMASK   0x04 ///< Reset Interrupt Flag         
#define CMINT_RSTINT__SHIFT   0x02 ///< Reset Interrupt Flag         
#define CMINT_RSTINT__NOT_SET 0x00 ///< Reset interrupt inactive.    
#define CMINT_RSTINT__SET     0x04 ///< Reset interrupt active.      
                                                                     
#define CMINT_SOF__BMASK      0x08 ///< Start of Frame Interrupt Flag
#define CMINT_SOF__SHIFT      0x03 ///< Start of Frame Interrupt Flag
#define CMINT_SOF__NOT_SET    0x00 ///< SOF interrupt inactive.      
#define CMINT_SOF__SET        0x08 ///< SOF interrupt active.        
                                                                     
//------------------------------------------------------------------------------
// E0CNT Enums (USB0 Endpoint0 Data Count @ 0x16)
//------------------------------------------------------------------------------
#define E0CNT_E0CNT__FMASK 0x7F ///< Endpoint 0 Data Count
#define E0CNT_E0CNT__SHIFT 0x00 ///< Endpoint 0 Data Count
                                                          
//------------------------------------------------------------------------------
// E0CSR Enums (USB0 Endpoint0 Control @ 0x11)
//------------------------------------------------------------------------------
#define E0CSR_OPRDY__BMASK     0x01 ///< OUT Packet Ready                                  
#define E0CSR_OPRDY__SHIFT     0x00 ///< OUT Packet Ready                                  
#define E0CSR_OPRDY__NOT_SET   0x00 ///< A data packet has not been received.              
#define E0CSR_OPRDY__SET       0x01 ///< A data packet has been received.                  
                                                                                           
#define E0CSR_INPRDY__BMASK    0x02 ///< IN Packet Ready                                   
#define E0CSR_INPRDY__SHIFT    0x01 ///< IN Packet Ready                                   
#define E0CSR_INPRDY__NOT_SET  0x00 ///< An IN packet is not ready to transmit.            
#define E0CSR_INPRDY__SET      0x02 ///< An IN packet is ready to transmit.                
                                                                                           
#define E0CSR_STSTL__BMASK     0x04 ///< Sent Stall                                        
#define E0CSR_STSTL__SHIFT     0x02 ///< Sent Stall                                        
#define E0CSR_STSTL__NOT_SET   0x00 ///< A STALL handshake signal was not transmitted.     
#define E0CSR_STSTL__SET       0x04 ///< A STALL handshake signal was transmitted.         
                                                                                           
#define E0CSR_DATAEND__BMASK   0x08 ///< Data End                                          
#define E0CSR_DATAEND__SHIFT   0x03 ///< Data End                                          
#define E0CSR_DATAEND__NOT_SET 0x00 ///< This is not the last data packet.                 
#define E0CSR_DATAEND__SET     0x08 ///< This is the last data packet.                     
                                                                                           
#define E0CSR_SUEND__BMASK     0x10 ///< Setup End                                         
#define E0CSR_SUEND__SHIFT     0x04 ///< Setup End                                         
#define E0CSR_SUEND__NOT_SET   0x00 ///< A control transaction did not end before firmware 
                                    ///< wrote a 1 to the DATAEND bit.                     
#define E0CSR_SUEND__SET       0x10 ///< A control transaction ended before firmware wrote 
                                    ///< a 1 to the DATAEND bit.                           
                                                                                           
#define E0CSR_SDSTL__BMASK     0x20 ///< Send Stall                                        
#define E0CSR_SDSTL__SHIFT     0x05 ///< Send Stall                                        
#define E0CSR_SDSTL__NOT_SET   0x00 ///< Do not send a STALL.                              
#define E0CSR_SDSTL__SET       0x20 ///< Send a STALL.                                     
                                                                                           
#define E0CSR_SOPRDY__BMASK    0x40 ///< Serviced OPRDY                                    
#define E0CSR_SOPRDY__SHIFT    0x06 ///< Serviced OPRDY                                    
#define E0CSR_SOPRDY__NOT_SET  0x00 ///< OUT packet has not been serviced.                 
#define E0CSR_SOPRDY__SET      0x40 ///< OUT packet has been serviced.                     
                                                                                           
#define E0CSR_SSUEND__BMASK    0x80 ///< Serviced Setup End                                
#define E0CSR_SSUEND__SHIFT    0x07 ///< Serviced Setup End                                
#define E0CSR_SSUEND__NOT_SET  0x00 ///< The setup end (SUEND) event has not been serviced.
#define E0CSR_SSUEND__SET      0x80 ///< The setup end (SUEND) event has been serviced.    
                                                                                           
//------------------------------------------------------------------------------
// EINCSRH Enums (USB0 IN Endpoint Control High @ 0x12)
//------------------------------------------------------------------------------
#define EINCSRH_FCDT__BMASK         0x08 ///< Force Data Toggle                                
#define EINCSRH_FCDT__SHIFT         0x03 ///< Force Data Toggle                                
#define EINCSRH_FCDT__ACK_TOGGLE    0x00 ///< Endpoint data toggle switches only when an ACK is
                                         ///< received following a data packet transmission.   
#define EINCSRH_FCDT__ALWAYS_TOGGLE 0x08 ///< Endpoint data toggle forced to switch after every
                                         ///< data packet is transmitted, regardless of ACK    
                                         ///< reception.                                       
                                                                                               
#define EINCSRH_ISO__BMASK          0x40 ///< Isochronous Transfer Enable                      
#define EINCSRH_ISO__SHIFT          0x06 ///< Isochronous Transfer Enable                      
#define EINCSRH_ISO__DISABLED       0x00 ///< Endpoint configured for Bulk/Interrupt transfers.
#define EINCSRH_ISO__ENABLED        0x40 ///< Endpoint configured for Isochronous transfers.   
                                                                                               
#define EINCSRH_DBIEN__BMASK        0x80 ///< IN Endpoint Double-Buffer Enable                 
#define EINCSRH_DBIEN__SHIFT        0x07 ///< IN Endpoint Double-Buffer Enable                 
#define EINCSRH_DBIEN__DISABLED     0x00 ///< Disable double-buffering for the selected IN     
                                         ///< endpoint.                                        
#define EINCSRH_DBIEN__ENABLED      0x80 ///< Enable double-buffering for the selected IN      
                                         ///< endpoint.                                        
                                                                                               
//------------------------------------------------------------------------------
// EINCSRL Enums (USB0 IN Endpoint Control Low @ 0x11)
//------------------------------------------------------------------------------
#define EINCSRL_INPRDY__BMASK     0x01 ///< In Packet Ready                                   
#define EINCSRL_INPRDY__SHIFT     0x00 ///< In Packet Ready                                   
#define EINCSRL_INPRDY__NOT_SET   0x00 ///< A packet is not available in the Endpoint IN FIFO.
#define EINCSRL_INPRDY__SET       0x01 ///< A packet is available in the Endpoint IN FIFO.    
                                                                                              
#define EINCSRL_FIFONE__BMASK     0x02 ///< FIFO Not Empty                                    
#define EINCSRL_FIFONE__SHIFT     0x01 ///< FIFO Not Empty                                    
#define EINCSRL_FIFONE__EMPTY     0x00 ///< The IN Endpoint FIFO is empty.                    
#define EINCSRL_FIFONE__NOT_EMPTY 0x02 ///< The IN Endpoint FIFO contains one or more packets.
                                                                                              
#define EINCSRL_UNDRUN__BMASK     0x04 ///< Data Underrun Flag                                
#define EINCSRL_UNDRUN__SHIFT     0x02 ///< Data Underrun Flag                                
#define EINCSRL_UNDRUN__NOT_SET   0x00 ///< A data underrun did not occur.                    
#define EINCSRL_UNDRUN__SET       0x04 ///< A data underrun occurred.                         
                                                                                              
