ahtn/keyplus/ports/efm8/efm8/mcu/C8051F326/inc/SI_C8051F326_Register_Enums.h
#define EINCSRL_FLUSH__BMASK      0x08 ///< FIFO Flush                                        
#define EINCSRL_FLUSH__SHIFT      0x03 ///< FIFO Flush                                        
#define EINCSRL_FLUSH__NOT_SET    0x00 ///< Do not flush the next packet.                     
#define EINCSRL_FLUSH__SET        0x08 ///< Flush the next packet to be transmitted from the  
                                       ///< IN Endpoint FIFO.                                 
                                                                                              
#define EINCSRL_SDSTL__BMASK      0x10 ///< Send Stall                                        
#define EINCSRL_SDSTL__SHIFT      0x04 ///< Send Stall                                        
#define EINCSRL_SDSTL__NOT_SET    0x00 ///< Terminate the STALL.                              
#define EINCSRL_SDSTL__SET        0x10 ///< Generate a STALL in response to an IN token.      
                                                                                              
#define EINCSRL_STSTL__BMASK      0x20 ///< Sent Stall Flag                                   
#define EINCSRL_STSTL__SHIFT      0x05 ///< Sent Stall Flag                                   
#define EINCSRL_STSTL__NOT_SET    0x00 ///< A STALL handshake was not transmitted.            
#define EINCSRL_STSTL__SET        0x20 ///< A STALL handshake was transmitted.                
                                                                                              
#define EINCSRL_CLRDT__BMASK      0x40 ///< Clear Data Toggle                                 
#define EINCSRL_CLRDT__SHIFT      0x06 ///< Clear Data Toggle                                 
#define EINCSRL_CLRDT__CLEAR      0x00 ///< Clear the IN Endpoint data toggle.                
                                                                                              
//------------------------------------------------------------------------------
// EOUTCNTH Enums (USB0 OUT Endpoint Count High @ 0x17)
//------------------------------------------------------------------------------
#define EOUTCNTH_EOCH__FMASK 0x03 ///< OUT Endpoint Count High
#define EOUTCNTH_EOCH__SHIFT 0x00 ///< OUT Endpoint Count High
                                                              
//------------------------------------------------------------------------------
// EOUTCNTL Enums (USB0 OUT Endpoint Count Low @ 0x16)
//------------------------------------------------------------------------------
#define EOUTCNTL_EOCL__FMASK 0xFF ///< OUT Endpoint Count Low
#define EOUTCNTL_EOCL__SHIFT 0x00 ///< OUT Endpoint Count Low
                                                             
//------------------------------------------------------------------------------
// EOUTCSRH Enums (USB0 OUT Endpoint Control High @ 0x15)
//------------------------------------------------------------------------------
#define EOUTCSRH_ISO__BMASK      0x40 ///< Isochronous Transfer Enable                      
#define EOUTCSRH_ISO__SHIFT      0x06 ///< Isochronous Transfer Enable                      
#define EOUTCSRH_ISO__DISABLED   0x00 ///< Endpoint configured for Bulk/Interrupt transfers.
#define EOUTCSRH_ISO__ENABLED    0x40 ///< Endpoint configured for Isochronous transfers.   
                                                                                            
#define EOUTCSRH_DBOEN__BMASK    0x80 ///< Double-Buffer Enable                             
#define EOUTCSRH_DBOEN__SHIFT    0x07 ///< Double-Buffer Enable                             
#define EOUTCSRH_DBOEN__DISABLED 0x00 ///< Disable double-buffering for the selected OUT    
                                      ///< endpoint.                                        
#define EOUTCSRH_DBOEN__ENABLED  0x80 ///< Enable double-buffering for the selected OUT     
                                      ///< endpoint.                                        
                                                                                            
//------------------------------------------------------------------------------
// EOUTCSRL Enums (USB0 OUT Endpoint Control Low @ 0x14)
//------------------------------------------------------------------------------
#define EOUTCSRL_OPRDY__BMASK      0x01 ///< OUT Packet Ready                                  
#define EOUTCSRL_OPRDY__SHIFT      0x00 ///< OUT Packet Ready                                  
#define EOUTCSRL_OPRDY__NOT_SET    0x00 ///< A data packet is not available in the Endpoint OUT
                                        ///< FIFO.                                             
#define EOUTCSRL_OPRDY__SET        0x01 ///< A data packet is available in the Endpoint OUT    
                                        ///< FIFO.                                             
                                                                                               
#define EOUTCSRL_FIFOFUL__BMASK    0x02 ///< OUT FIFO Full                                     
#define EOUTCSRL_FIFOFUL__SHIFT    0x01 ///< OUT FIFO Full                                     
#define EOUTCSRL_FIFOFUL__NOT_FULL 0x00 ///< OUT endpoint FIFO is not full.                    
#define EOUTCSRL_FIFOFUL__FULL     0x02 ///< OUT endpoint FIFO is full.                        
                                                                                               
#define EOUTCSRL_OVRUN__BMASK      0x04 ///< Data Overrun Flag                                 
#define EOUTCSRL_OVRUN__SHIFT      0x02 ///< Data Overrun Flag                                 
#define EOUTCSRL_OVRUN__NOT_SET    0x00 ///< No data overrun.                                  
#define EOUTCSRL_OVRUN__SET        0x04 ///< A data packet was lost because of a full FIFO     
                                        ///< since this flag was last cleared.                 
                                                                                               
#define EOUTCSRL_DATERR__BMASK     0x08 ///< Data Error Flag                                   
#define EOUTCSRL_DATERR__SHIFT     0x03 ///< Data Error Flag                                   
#define EOUTCSRL_DATERR__NOT_SET   0x00 ///< A received packet does not have a CRC or bit-     
                                        ///< stuffing error.                                   
#define EOUTCSRL_DATERR__SET       0x08 ///< A received packet has a CRC or bit-stuffing error.
                                                                                               
#define EOUTCSRL_FLUSH__BMASK      0x10 ///< FIFO Flush                                        
#define EOUTCSRL_FLUSH__SHIFT      0x04 ///< FIFO Flush                                        
#define EOUTCSRL_FLUSH__NOT_SET    0x00 ///< Do not flush the next packet.                     
#define EOUTCSRL_FLUSH__SET        0x10 ///< Flush the next packet to be read from the OUT     
                                        ///< endpoint FIFO.                                    
                                                                                               
#define EOUTCSRL_SDSTL__BMASK      0x20 ///< Send Stall                                        
#define EOUTCSRL_SDSTL__SHIFT      0x05 ///< Send Stall                                        
#define EOUTCSRL_SDSTL__NOT_SET    0x00 ///< Terminate the STALL.                              
#define EOUTCSRL_SDSTL__SET        0x20 ///< Generate a STALL handshake.                       
                                                                                               
#define EOUTCSRL_STSTL__BMASK      0x40 ///< Sent Stall Flag                                   
#define EOUTCSRL_STSTL__SHIFT      0x06 ///< Sent Stall Flag                                   
#define EOUTCSRL_STSTL__NOT_SET    0x00 ///< A STALL handshake was not transmitted.            
#define EOUTCSRL_STSTL__SET        0x40 ///< A STALL handshake was transmitted.                
                                                                                               
#define EOUTCSRL_CLRDT__BMASK      0x80 ///< Clear Data Toggle                                 
#define EOUTCSRL_CLRDT__SHIFT      0x07 ///< Clear Data Toggle                                 
#define EOUTCSRL_CLRDT__CLEAR      0x00 ///< Clear the OUT Endpoint data toggle.               
                                                                                               
//------------------------------------------------------------------------------
// FADDR Enums (USB0 Function Address @ 0x00)
//------------------------------------------------------------------------------
#define FADDR_FADDR__FMASK    0x7F ///< Function Address                               
#define FADDR_FADDR__SHIFT    0x00 ///< Function Address                               
                                                                                       
#define FADDR_UPDATE__BMASK   0x80 ///< Function Address Update                        
#define FADDR_UPDATE__SHIFT   0x07 ///< Function Address Update                        
#define FADDR_UPDATE__NOT_SET 0x00 ///< The last address written to FADDR is in effect.
#define FADDR_UPDATE__SET     0x80 ///< The last address written to FADDR is not yet in
                                   ///< effect.                                        
                                                                                       
//------------------------------------------------------------------------------
// FIFO0 Enums (USB0 Endpoint 0 FIFO Access @ 0x20)
//------------------------------------------------------------------------------
#define FIFO0_FIFODATA__FMASK 0xFF ///< Endpoint 0 FIFO Access
#define FIFO0_FIFODATA__SHIFT 0x00 ///< Endpoint 0 FIFO Access
                                                              
//------------------------------------------------------------------------------
// FIFO1 Enums (USB0 Endpoint 1 FIFO Access @ 0x21)
//------------------------------------------------------------------------------
#define FIFO1_FIFODATA__FMASK 0xFF ///< Endpoint 1 FIFO Access
#define FIFO1_FIFODATA__SHIFT 0x00 ///< Endpoint 1 FIFO Access
                                                              
//------------------------------------------------------------------------------
// FRAMEH Enums (USB0 Frame Number High @ 0x0D)
//------------------------------------------------------------------------------
#define FRAMEH_FRMEH__FMASK 0x07 ///< Frame Number High
#define FRAMEH_FRMEH__SHIFT 0x00 ///< Frame Number High
                                                       
//------------------------------------------------------------------------------
// FRAMEL Enums (USB0 Frame Number Low @ 0x0C)
//------------------------------------------------------------------------------
#define FRAMEL_FRMEL__FMASK 0xFF ///< Frame Number Low
#define FRAMEL_FRMEL__SHIFT 0x00 ///< Frame Number Low
                                                      
//------------------------------------------------------------------------------
// IN1IE Enums (USB0 IN Endpoint Interrupt Enable @ 0x07)
//------------------------------------------------------------------------------
#define IN1IE_EP0E__BMASK    0x01 ///< Endpoint 0 Interrupt Enable      
#define IN1IE_EP0E__SHIFT    0x00 ///< Endpoint 0 Interrupt Enable      
#define IN1IE_EP0E__DISABLED 0x00 ///< Disable Endpoint 0 interrupts.   
#define IN1IE_EP0E__ENABLED  0x01 ///< Enable Endpoint 0 interrupts.    
                                                                        
#define IN1IE_IN1E__BMASK    0x02 ///< IN Endpoint 1 Interrupt Enable   
#define IN1IE_IN1E__SHIFT    0x01 ///< IN Endpoint 1 Interrupt Enable   
#define IN1IE_IN1E__DISABLED 0x00 ///< Disable Endpoint 1 IN interrupts.
#define IN1IE_IN1E__ENABLED  0x02 ///< Enable Endpoint 1 IN interrupts. 
                                                                        
//------------------------------------------------------------------------------
// IN1INT Enums (USB0 IN Endpoint Interrupt @ 0x02)
//------------------------------------------------------------------------------
#define IN1INT_EP0__BMASK   0x01 ///< Endpoint 0 Interrupt Flag        
#define IN1INT_EP0__SHIFT   0x00 ///< Endpoint 0 Interrupt Flag        
#define IN1INT_EP0__NOT_SET 0x00 ///< Endpoint 0 interrupt inactive.   
#define IN1INT_EP0__SET     0x01 ///< Endpoint 0 interrupt active.     
                                                                       
#define IN1INT_IN1__BMASK   0x02 ///< IN Endpoint 1 Interrupt Flag     
#define IN1INT_IN1__SHIFT   0x01 ///< IN Endpoint 1 Interrupt Flag     
#define IN1INT_IN1__NOT_SET 0x00 ///< IN Endpoint 1 interrupt inactive.
#define IN1INT_IN1__SET     0x02 ///< IN Endpoint 1 interrupt active.  
                                                                       
//------------------------------------------------------------------------------
// INDEX Enums (USB0 Endpoint Index @ 0x0E)
//------------------------------------------------------------------------------
#define INDEX_EPSEL__FMASK      0x0F ///< Endpoint Select Bits
#define INDEX_EPSEL__SHIFT      0x00 ///< Endpoint Select Bits
#define INDEX_EPSEL__ENDPOINT_0 0x00 ///< Endpoint 0.         
#define INDEX_EPSEL__ENDPOINT_1 0x01 ///< Endpoint 1.         
                                                              
//------------------------------------------------------------------------------
// OUT1IE Enums (USB0 OUT Endpoint Interrupt Enable @ 0x09)
//------------------------------------------------------------------------------
#define OUT1IE_OUT1E__BMASK    0x02 ///< OUT Endpoint 1 Interrupt Enable   
#define OUT1IE_OUT1E__SHIFT    0x01 ///< OUT Endpoint 1 Interrupt Enable   
#define OUT1IE_OUT1E__DISABLED 0x00 ///< Disable Endpoint 1 OUT interrupts.
#define OUT1IE_OUT1E__ENABLED  0x02 ///< Enable Endpoint 1 OUT interrupts. 
                                                                           
//------------------------------------------------------------------------------
// OUT1INT Enums (USB0 OUT Endpoint Interrupt @ 0x04)
//------------------------------------------------------------------------------
#define OUT1INT_OUT1__BMASK   0x02 ///< OUT Endpoint 1 Interrupt Flag     
#define OUT1INT_OUT1__SHIFT   0x01 ///< OUT Endpoint 1 Interrupt Flag     
#define OUT1INT_OUT1__NOT_SET 0x00 ///< OUT Endpoint 1 interrupt inactive.
#define OUT1INT_OUT1__SET     0x02 ///< OUT Endpoint 1 interrupt active.  
                                                                          
//------------------------------------------------------------------------------
// POWER Enums (USB0 Power @ 0x01)
//------------------------------------------------------------------------------
#define POWER_SUSEN__BMASK         0x01 ///< Suspend Detection Enable                          
#define POWER_SUSEN__SHIFT         0x00 ///< Suspend Detection Enable                          
#define POWER_SUSEN__DISABLED      0x00 ///< Disable suspend detection. USB0 will ignore       
                                        ///< suspend signaling on the bus.                     
#define POWER_SUSEN__ENABLED       0x01 ///< Enable suspend detection. USB0 will enter suspend 
                                        ///< mode if it detects suspend signaling on the bus.  
                                                                                               
#define POWER_SUSMD__BMASK         0x02 ///< Suspend Mode                                      
#define POWER_SUSMD__SHIFT         0x01 ///< Suspend Mode                                      
#define POWER_SUSMD__NOT_SUSPENDED 0x00 ///< USB0 not in suspend mode.                         
#define POWER_SUSMD__SUSPENDED     0x02 ///< USB0 in suspend mode.                             
                                                                                               
#define POWER_RESUME__BMASK        0x04 ///< Force Resume                                      
#define POWER_RESUME__SHIFT        0x02 ///< Force Resume                                      
#define POWER_RESUME__START        0x04 ///< Generate resume signalling to create a remote     
                                        ///< wakeup event.                                     
                                                                                               
#define POWER_USBRST__BMASK        0x08 ///< Reset Detect                                      
#define POWER_USBRST__SHIFT        0x03 ///< Reset Detect                                      
#define POWER_USBRST__NOT_SET      0x00 ///< USB reset signalling not detected.                
#define POWER_USBRST__SET          0x08 ///< USB reset signalling detected.                    
                                                                                               
#define POWER_USBINH__BMASK        0x10 ///< USB0 Inhibit                                      
#define POWER_USBINH__SHIFT        0x04 ///< USB0 Inhibit                                      
#define POWER_USBINH__ENABLED      0x00 ///< USB0 enabled.                                     
#define POWER_USBINH__DISABLED     0x10 ///< USB0 inhibited. All USB traffic is ignored.       
                                                                                               
#define POWER_ISOUD__BMASK         0x80 ///< Isochronous Update Mode                           
#define POWER_ISOUD__SHIFT         0x07 ///< Isochronous Update Mode                           
#define POWER_ISOUD__IN_TOKEN      0x00 ///< When firmware writes INPRDY = 1, USB0 will send   
                                        ///< the packet when the next IN token is received.    
#define POWER_ISOUD__SOF_TOKEN     0x80 ///< When firmware writes INPRDY = 1, USB0 will wait   
                                        ///< for a SOF token before sending the packet. If an  
                                        ///< IN token is received before a SOF token, USB0 will
                                        ///< send a zero-length data packet.                   
                                                                                               
//------------------------------------------------------------------------------
// USB0ADR Enums (USB0 Indirect Address @ 0x96)
//------------------------------------------------------------------------------
#define USB0ADR_USBADDR__FMASK          0x3F ///< USB0 Indirect Register Address                    
#define USB0ADR_USBADDR__SHIFT          0x00 ///< USB0 Indirect Register Address                    
#define USB0ADR_USBADDR__FADDR          0x00 ///< Function Address.                                 
#define USB0ADR_USBADDR__POWER          0x01 ///< Power Management.                                 
#define USB0ADR_USBADDR__IN1INT         0x02 ///< Endpoint 0 and Endpoints 1-3 IN Interrupt Flags.  
#define USB0ADR_USBADDR__OUT1INT        0x04 ///< Endpoints 1-3 OUT Interrupt Flags.                
#define USB0ADR_USBADDR__CMINT          0x06 ///< Common USB Interrupt Flags.                       
#define USB0ADR_USBADDR__IN1IE          0x07 ///< Endpoint 0 and Endpoints 1-3 IN Interrupt Enables.
#define USB0ADR_USBADDR__OUT1IE         0x09 ///< Endpoints 1-3 OUT Interrupt Enables.              
#define USB0ADR_USBADDR__CMIE           0x0B ///< Common USB Interrupt Enables.                     
#define USB0ADR_USBADDR__FRAMEL         0x0C ///< Frame Number Low Byte.                            
#define USB0ADR_USBADDR__FRAMEH         0x0D ///< Frame Number High Byte.                           
#define USB0ADR_USBADDR__INDEX          0x0E ///< Endpoint Index Selection.                         
#define USB0ADR_USBADDR__CLKREC         0x0F ///< Clock Recovery Control.                           
#define USB0ADR_USBADDR__E0CSR_EINCSRL  0x11 ///< Endpoint 0 Control / Status, Endpoint IN Control /
                                             ///< Status Low Byte.                                  
#define USB0ADR_USBADDR__EINCSRH        0x12 ///< Endpoint IN Control / Status High Byte.           
#define USB0ADR_USBADDR__EOUTCSRL       0x14 ///< Endpoint OUT Control / Status Low Byte.           
#define USB0ADR_USBADDR__EOUTCSRH       0x15 ///< Endpoint OUT Control / Status High Byte.          
#define USB0ADR_USBADDR__E0CNT_EOUTCNTL 0x16 ///< Number of Received Bytes in Endpoint 0 FIFO,      
                                             ///< Endpoint OUT Packet Count Low Byte.               
#define USB0ADR_USBADDR__EOUTCNTH       0x17 ///< Endpoint OUT Packet Count High Byte.              
#define USB0ADR_USBADDR__EENABLE        0x1E ///< Endpoint Enable.                                  
#define USB0ADR_USBADDR__FIFO0          0x20 ///< Endpoint 0 FIFO.                                  
#define USB0ADR_USBADDR__FIFO1          0x21 ///< Endpoint 1 FIFO.                                  
                                                                                                    
#define USB0ADR_AUTORD__BMASK           0x40 ///< USB0 Register Auto-Read Flag                      
#define USB0ADR_AUTORD__SHIFT           0x06 ///< USB0 Register Auto-Read Flag                      
#define USB0ADR_AUTORD__DISABLED        0x00 ///< BUSY must be written manually for each USB0       
                                             ///< indirect register read.                           
#define USB0ADR_AUTORD__ENABLED         0x40 ///< The next indirect register read will automatically
                                             ///< be initiated when firmware reads USB0DAT (USBADDR 
                                             ///< bits will not be changed).                        
                                                                                                    
#define USB0ADR_BUSY__BMASK             0x80 ///< USB0 Register Read Busy Flag                      
#define USB0ADR_BUSY__SHIFT             0x07 ///< USB0 Register Read Busy Flag                      
#define USB0ADR_BUSY__NOT_SET           0x00 ///< A read is not in progress.                        
#define USB0ADR_BUSY__SET               0x80 ///< Initiate a read or a read is in progress.         
                                                                                                    
//------------------------------------------------------------------------------
// USB0DAT Enums (USB0 Data @ 0x97)
//------------------------------------------------------------------------------
#define USB0DAT_USB0DAT__FMASK 0xFF ///< USB0 Data
#define USB0DAT_USB0DAT__SHIFT 0x00 ///< USB0 Data
                                                  
//------------------------------------------------------------------------------
// USB0XCN Enums (USB0 Transceiver Control @ 0xD7)
//------------------------------------------------------------------------------
#define USB0XCN_Dn__BMASK                0x01 ///< D- Signal Status                                 
#define USB0XCN_Dn__SHIFT                0x00 ///< D- Signal Status                                 
#define USB0XCN_Dn__LOW                  0x00 ///< D- signal currently at logic 0.                  
#define USB0XCN_Dn__HIGH                 0x01 ///< D- signal currently at logic 1.                  
                                                                                                    
